app/Controllers/Activity.php

    public function update($id){

        $data = [
            "name" => $this->request->getPost("name") ?? "unset",
            "priority" => $this->request->getPost("priority") ?? 0,
            "color" => $this->request->getPost("color") ?? "#000000"
        ];

        if($this->activityModel->update($id, $data))
---
UPDATE `activity` SET `name` = 'Dancingsadsad', `priority` = '3', `color` = '#bb1111'
WHERE `activity`.`id` IN ('9')