app/Controllers/Activity.php

INSERT INTO `activity` (`name`, `priority`, `color`, `user_id`) VALUES ('Running', '1', '#d4ff00', '3')
---
    public function insert(){

        $data = [
            "name" => $this->request->getPost("name") ?? "unset",
            "priority" => $this->request->getPost("priority") ?? 0,
            "color" => $this->request->getPost("color") ?? "#000000",
            "user_id" => session()->get("id"),
        ];

        if($this->activityModel->insert($data))

DELETE FROM `activity`
WHERE `id` IN ('10')
---
    public function delete($id){
        if($this->activityModel->checkOwnership($id))
            $this->activityModel->delete($id);