app/Models/AuthModel.php

INSERT INTO `auth_logins` (`user_id`, `firstname`, `lastname`, `role`, `ip_address`, `date`, `successfull`) VALUES ('3', 'Tomáš', 'Hotárek', '2', '::1', '2023-06-22 23:55:01', '1')
---
    public function LogLogin($data)
    {
        $this->db->table('auth_logins')
                 ->insert($data);